Repository: dotnet/sign
Catalog: src/Sign.SignatureProviders.CertificateStore/xlf/Resources.*.xlf
Languages: cs, de, ja, ko, pl, zh_hans, zh_hant

# CertificateNotFound
source: Unable to find a matching certificate.
cs: Nepovedlo se najít odpovídající certifikát.
de: Es wurde kein übereinstimmendes Zertifikat gefunden.
ja: 一致する証明書が見つかりません。
ko: 일치하는 인증서를 찾을 수 없습니다.
pl: Nie można znaleźć zgodnego certyfikatu.
zh_hans: 找不到匹配的证书。
zh_hant: 找不到相符的憑證。

# CertificateNotFoundInFile
source: Unable to find a certificate with a matching {0} fingerprint in {1}.
cs: V {1} nebylo možné najít certifikát s odpovídajícím digitálním otiskem {0}.
de: Es wurde kein Zertifikat mit einem übereinstimmenden {0}-Fingerabdruck in {1} gefunden.
ja: {1} で、{0} フィンガープリントが一致する証明書が見つかりません。
ko: {1}에서 일치하는 {0} 지문이 있는 인증서를 찾을 수 없습니다.
pl: Nie można odnaleźć certyfikatu z pasującym {0} odciskiem palca w {1}.
zh_hans: 在 {1} 中找不到具有匹配的 {0} 指纹的证书。
zh_hant: 在 {1} 中找不到具有相符 {0} 指紋的憑證。

# CertificateNotFoundInMachineStore
source: Unable to find a matching certificate in machine certificate store.
cs: V úložišti certifikátů počítače nebylo možné najít odpovídající certifikát.
de: Im Computerzertifikatspeicher wurde kein übereinstimmendes Zertifikat gefunden.
ja: コンピューター証明書ストアに一致する証明書が見つかりません。
ko: 컴퓨터 인증서 저장소에서 일치하는 인증서를 찾을 수 없습니다.
pl: Nie można znaleźć zgodnego certyfikatu w magazynie certyfikatów komputera.
zh_hans: 在计算机证书存储中找不到匹配的证书。
zh_hant: 無法在機器憑證存放區中找到相符的憑證。

# CertificateNotFoundInUserStore
source: Unable to find a matching certificate in user certificate store.
cs: V úložišti certifikátů uživatele nebylo možné najít odpovídající certifikát.
de: Im Benutzerzertifikatspeicher wurde kein übereinstimmendes Zertifikat gefunden.
ja: ユーザー証明書ストアに一致する証明書が見つかりません。
ko: 사용자 인증서 저장소에서 일치하는 인증서를 찾을 수 없습니다.
pl: Nie można znaleźć zgodnego certyfikatu w magazynie certyfikatów użytkownika.
zh_hans: 在用户证书存储中找不到匹配的证书。
zh_hant: 無法在使用者憑證存放區中找到相符的憑證。

# CertificateRSANotFound
source: Unable to acquire RSA private key for the provided certificate.
cs: Pro poskytnutý certifikát se nepovedlo získat privátní klíč RSA.
de: Der private RSA-Schlüssel für das angegebene Zertifikat kann nicht abgerufen werden.
ja: 指定された証明書の RSA 秘密キーを取得できません。
ko: 제공된 인증서의 RSA 프라이빗 키를 가져올 수 없습니다.
pl: Nie można uzyskać klucza prywatnego RSA dla podanego certyfikatu.
zh_hans: 无法获取所提供的证书的 RSA 私钥。
zh_hant: 無法取得所提供憑證的 RSA 私密金鑰。

# FetchedCertificateFromCertificateStore
source: Fetched certificate from certificate store. [{milliseconds} ms]
cs: Certifikát se načetl z úložiště certifikátů. [{milliseconds} ms]
de: Das Zertifikat wurde aus dem Zertifikatspeicher abgerufen. [{milliseconds} ms]
ja: 証明書ストアから証明書をフェッチしました。[{milliseconds} ms]
ko: 인증서 저장소에서 인증서를 가져왔습니다. [{milliseconds}초]
pl: Pobrano certyfikat z magazynu certyfikatów. [{milliseconds} ms]
zh_hans: 已从证书存储中提取证书。[{milliseconds} ms]
zh_hant: 已從憑證存放區擷取憑證。[{milliseconds} 毫秒]

# FetchedCertificateFromFile
source: Fetched certificate from file. [{milliseconds} ms]
cs: Certifikát se načetl ze souboru. [{milliseconds} ms]
de: Das Zertifikat wurde aus der Datei abgerufen. [{milliseconds} ms]
ja: ファイルから証明書をフェッチしました。[{milliseconds} ms]
ko: 파일에서 인증서를 가져왔습니다. [{milliseconds}초]
pl: Pobrano certyfikat z pliku. [{milliseconds} ms]
zh_hans: 已从文件中提取证书。[{milliseconds} ms]
zh_hant: 已從檔案擷取憑證。[{milliseconds} 毫秒]

source: Fetching certificate from certificate store.
cs: Certifikát se načítá z úložiště certifikátů.
de: Das Zertifikat wird aus dem Zertifikatspeicher abgerufen.
ja: 証明書ストアから証明書をフェッチしています。
ko: 인증서 저장소에서 인증서를 가져오는 중입니다.
pl: Pobieranie certyfikatu z magazynu certyfikatów.
zh_hans: 正在从证书存储中提取证书。
zh_hant: 正在從憑證存放區擷取憑證。

source: Fetching certificate from file.
cs: Certifikát se načítá ze souboru.
de: Das Zertifikat wird aus der Datei abgerufen.
ja: ファイルから証明書をフェッチしています。
ko: 파일에서 인증서를 가져오는 중입니다.
pl: Pobieranie certyfikatu z pliku.
zh_hans: 正在从文件中提取证书。
zh_hant: 正在從檔案擷取憑證。

# UnsupportedPublicKeyAlgorithm
source: The certificate has an unsupported public key algorithm.
cs: Certifikát má nepodporovaný algoritmus veřejného klíče.
de: Das Zertifikat verfügt über einen nicht unterstützten Algorithmus für öffentliche Schlüssel.
ja: 証明書にサポートされていない公開キー アルゴリズムがあります。
ko: 인증서에 지원되지 않는 공개 키 알고리즘이 있습니다.
pl: Certyfikat zawiera nieobsługiwany algorytmu kluczy publicznych.
zh_hans: 证书具有不受支持的公钥算法。
zh_hant: 憑證具有不支援的公開金鑰演算法。
