Repository: dotnet/sign
Catalog: src/Sign.Core/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# VsixSignatureProviderSigning
source: Signing OpenVsixSignTool job with {count} files.
cs: Podepisování úlohy OpenVsixSignTool pomocí tohoto počtu souborů: {count}.
de: OpenVsixSignTool-Auftrag wird mit {count} Dateien signiert.
fr: Signature du travail OpenVsixSignTool avec {count} fichiers.
ja: {count} 個のファイルを使用して OpenVsixSignTool ジョブに署名しています。
ko: {count} 파일로 OpenVsixSignTool 작업에 서명하는 중입니다.
pl: Podpisywanie zadania OpenVsixSignTool przy użyciu {count} plików.
ru: Подписывание задания OpenVsixSignTool с несколькими файлами ({count}).
tr: OpenVsixSignTool işi {count} dosya ile imzalanıyor.
zh_hans: 正在对包含 {count} 个文件的 OpenVsixSignTool 作业进行签名。
zh_hant: 正在簽署具有 {count} 個檔案的 OpenVsixSignTool 工作。

# SigningSucceededWithTimeElapsed
source: Successfully signed {filePath} in {millseconds} ms
cs: Soubor {filePath} se úspěšně podepsal za {millseconds} ms.
de: {filePath} wurde in {millseconds} ms erfolgreich signiert.
fr: {filePath} signé en {millseconds} ms
ko: {millseconds}ms 내에 {filePath}에 서명했습니다.
pl: Pomyślnie podpisano ścieżkę {filePath} w ciągu {millseconds} ms
ru: Успешно подписано {filePath} за {millseconds} мс
zh_hans: 已成功在 {millseconds} 毫秒内对 {filePath} 进行签名
zh_hant: 已成功在 {millseconds} 毫秒內簽署 {filePath}
