Repository: dotnet/sign
Catalog: src/Sign.Core/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AzureSignToolSignatureProviderSigning
source: Signing SignTool job with {count} files.
cs: Podepisování úlohy SignTool s tímto počtem souborů: {count}.
de: Der SignTool-Auftrag wird mit {count} Dateien signiert.
es: Firmando el trabajo de SignTool con {count} archivos.
fr: Signature du travail SignTool avec {count} fichiers.
it: Firma del processo SignTool con {count} file.
ja: {count} 個のファイルを使用して SignTool ジョブに署名しています。
ko: {count} 파일로 SignTool 작업에 서명하는 중입니다.
pl: Podpisywanie zadania SignTool przy użyciu {count} plików.
pt_br: Autenticando o trabalho SignTool com {count} arquivos.
ru: Задание подписывания SignTool с несколькими файлами ({count}).
tr: SignTool işi {count} dosya ile imzalanıyor.
zh_hans: 正在对包含 {count} 个文件的 SignTool 作业进行签名。
zh_hant: 正在簽署具有 {count} 個檔案的 SignTool 工作。

# CertificateIsExpired
source: The certificate is expired.
cs: Platnost certifikátu vypršela.
de: Das Zertifikat ist abgelaufen.
es: El certificado ha expirado.
fr: Le certificat est arrivé à expiration.
it: Il certificato è scaduto.
ja: 証明書の有効期限が切れています。
ko: 인증서가 만료되었습니다.
pl: Certyfikat stracił ważność.
pt_br: O certificado expirou.
ru: Срок действия сертификата истек.
tr: Sertifikanın süresi doldu.
zh_hans: 证书已过期。
zh_hant: 憑證已過期。

# CertificateIsNotYetTimeValid
source: The certificate is not yet time valid.
cs: Certifikát ještě není platný.
de: Das Zertifikat ist noch nicht gültig.
es: El certificado aún no es válido en tiempo.
fr: La date de début du certificat n’est pas encore valide.
it: Il certificato non è ancora valido in termini di tempo.
ja: 証明書はまだ有効な時間ではありません。
ko: 인증서가 아직 유효하지 않습니다.
pl: Certyfikat nie jest jeszcze ważny czasowo.
pt_br: O certificado ainda não é válido.
ru: Срок действия сертификата еще не начался.
tr: Bu sertifikanın geçerlilik süresi henüz başlamadı.
zh_hans: 该证书尚未生效。
zh_hant: 憑證尚未生效。

# CertificateNotFound
source: Unable to find a matching certificate.
es: No se pudo encontrar ningún certificado que coincida.
it: Impossibile trovare un certificato corrispondente.
pt_br: Não foi possível localizar um certificado correspondente.

# CertificateNotFoundInFile
source: Unable to find a certificate with a matching {0} fingerprint in {1}.
es: No se pudo encontrar ningún certificado con una huella digital {0} coincidente en {1}.
it: Non è possibile trovare un certificato con un'impronta digitale {0} corrispondente in {1}.
pt_br: Não é possível localizar um certificado com uma impressão digital correspondente {0} em {1}.

# CertificateNotFoundInMachineStore
source: Unable to find a matching certificate in machine certificate store.
es: No se pudo encontrar un certificado correspondiente en el almacén de certificados de máquina.
it: Impossibile trovare un certificato corrispondente nell'archivio certificati del computer.
pt_br: Não foi possível localizar um certificado correspondente no repositório de certificados do computador.

# CertificateNotFoundInUserStore
source: Unable to find a matching certificate in user certificate store.
es: No se pudo encontrar un certificado correspondiente en el almacén de certificados de usuario.
it: Impossibile trovare un certificato corrispondente nell'archivio certificati dell'utente.
pt_br: Não foi possível localizar um certificado correspondente no repositório de certificados do usuário.

# CertificateRSANotFound
source: Unable to acquire RSA private key for the provided certificate.
es: No se puede adquirir la clave privada RSA para el certificado proporcionado.
it: Impossibile acquisire la chiave privata RSA per il certificato fornito.
pt_br: Não foi possível adquirir a chave privada RSA para o certificado fornecido.

# CliStandardError
source: {fileName} returned the error {error}
es: {fileName} devolvió el error {error}
it: {fileName} ha restituito l'errore {error}
ja: {fileName} がエラー {error} を返しました
pt_br: {fileName} retornou o erro {error}
tr: {fileName}, {error} hatasını döndürdü

# CliStandardOutput
source: {fileName} returned the output {output}
es: {fileName} devolvió la salida {output}
it: {fileName} ha restituito l'output {output}
ja: {fileName} が出力 {output} を返しました
pt_br: {fileName} retornou a saída {output}
tr: {fileName}, {output} çıkışını döndürdü

# ClickOnceSignatureProviderSigning
source: Signing Mage job with {count} files.
cs: Podepisování úlohy Mage pomocí {count} souborů.
de: Der Mage-Auftrag wird mit {count} Dateien signiert.
es: Firmando el trabajo de Mage con {count} archivos.
fr: Signature du travail Mage avec {count} fichiers.
it: Firma del processo Mage con {count} file.
ja: {count} 個のファイルを使用して Mage ジョブに署名しています。
ko: {count} 파일로 Mage 작업에 서명하는 중입니다.
pl: Podpisywanie zadania Mage przy użyciu {count} plików.
pt_br: Autenticando o trabalho Mage com {count} arquivos.
ru: Подписывание задания Mage с несколькими файлами ({count}).
tr: Mage işi {count} dosya ile imzalanıyor.
zh_hans: 正在对包含 {count} 个文件的 Mage 作业进行签名。
zh_hant: 正在簽署具有 {count} 個檔案的 Mage 工作。

# CreatingDirectory
source: Creating directory {path}.
cs: Vytváří se adresář {path}.
de: Das Verzeichnis {path} wird erstellt.
es: Creando directorio {path}.
fr: Création du répertoire {path}.
it: Creazione della directory {path}.
ja: ディレクトリ {path} を作成しています。
ko: 디렉터리 {path}을(를) 생성하는 중입니다.
pl: Tworzenie ścieżki {path} katalogu.
pt_br: Criando o diretório {path}.
ru: Идет создание каталога {path}.
tr: {path} dizini oluşturuluyor.
zh_hans: 正在创建目录 {path}。
zh_hant: 正在建立目錄 {path}。

# DeletedDirectory
source: Directory {path} deleted.
cs: Adresář {path} se odstranil.
de: Das Verzeichnis {path} wurde gelöscht.
es: Directorio {path} eliminado.
fr: Répertoire {path} supprimé.
it: {path} directory eliminato.
ja: ディレクトリ {path} が削除されました。
ko: 디렉터리 {path}이(가) 삭제되었습니다.
pl: Usunięto ścieżkę {path} katalogu.
pt_br: Diretório {path} excluído.
ru: Каталог {path} удален.
tr: {path} dizini silindi.
zh_hans: 已删除目录 {path}。
zh_hant: 已刪除目錄 {path}。

# DeletingDirectory
source: Deleting directory {path}.
cs: Odstraňuje se adresář {path}.
de: Das Verzeichnis {path} wird gelöscht.
es: Eliminando el directorio {path}.
fr: Suppression du répertoire {path}.
it: Eliminazione della directory {path}.
ja: ディレクトリ {path} を削除しています。
ko: 디렉터리 {path}을(를) 삭제하는 중입니다.
pl: Usuwanie ścieżki {path} katalogu.
pt_br: Excluindo o diretório {path}.
ru: Идет удаление каталога {path}.
tr: {path} dizini siliniyor.
zh_hans: 正在删除目录 {path}。
zh_hant: 正在刪除目錄 {path}。

# DirectoryNotDeleted
source: Directory {path} still exists.
cs: Adresář {path} stále existuje.
de: Das Verzeichnis {path} ist noch vorhanden.
es: El directorio {path} todavía existe.
fr: Le répertoire {path} existe toujours.
it: {path} della directory esiste ancora.
ja: ディレクトリ {path} がまだ存在します。
ko: 디렉터리 {path}이(가) 여전히 존재합니다.
pl: Ścieżka {path} katalogu nadal istnieje.
pt_br: O diretório {path} ainda existe.
ru: Каталог {path} все еще существует.
tr: {path} hala mevcut.
zh_hans: 目录 {path} 仍然存在。
zh_hant: 目錄 {path} 仍然存在。

# EditingAppInstaller
source: Editing AppInstaller job with {count} files.
cs: Upravuje se úloha AppInstaller s tímto počtem souborů: {count}.
de: AppInstaller-Auftrag wird mit {count} Dateien bearbeitet.
es: Editando el trabajo AppInstaller con {count} archivos.
fr: Modification du travail AppInstaller avec {count} fichiers.
it: Modifica del processo AppInstaller con {count} file.
ja: {count} 個のファイルを使用して AppInstaller ジョブを編集しています。
ko: {count} 파일로 AppInstaller 작업을 편집하는 중입니다.
pl: Edytowanie zadania AppInstaller przy użyciu {count} plików.
pt_br: Editando o trabalho do AppInstaller com {count} arquivos.
ru: Изменение задания AppInstaller с несколькими файлами ({count}).
tr: AppInstaller işi {count} dosya ile düzenleniyor.
zh_hans: 正在编辑包含 {count} 个文件的 AppInstaller 作业。
zh_hant: 正在編輯具有 {count} 個檔案的 AppInstaller 工作。

# ErrorSigningVsix
source: An unspecified error occurred during VSIX signing.
cs: Při podepisování VSIX došlo k neurčené chybě.
de: Während der VSIX-Signierung ist ein nicht spezifizierter Fehler aufgetreten.
es: Error no especificado durante la firma VSIX.
fr: Une erreur non spécifiée s’est produite lors de la signature VSIX.
it: Si è verificato un errore non specificato durante la firma di VSIX.
ja: VSIX の署名中に未指定のエラーが発生しました。
ko: VSIX 서명 중에 지정되지 않은 오류가 발생했습니다.
pl: Wystąpił nieokreślony błąd podczas podpisywania jednostki VSIX.
pt_br: Ocorreu um erro não especificado durante a autenticação do VSIX.
ru: Во время подписывания VSIX произошла неопознанная ошибка.
tr: VSIX imzalaması sırasında belirtilmeyen bir hata oluştu.
zh_hans: VSIX 签名期间发生未指定的错误。
zh_hant: VSIX 簽署期間發生未指定的錯誤。

# ExceptionWhileDeletingDirectory
source: An exception occurred while attempting to delete directory {path}.
cs: Při pokusu o odstranění adresáře {path} došlo k výjimce.
de: Beim Versuch, das Verzeichnis {path} zu löschen, ist eine Ausnahme aufgetreten.
es: Se produjo una excepción al intentar eliminar el directorio {path}.
fr: Une exception s’est produite lors de la tentative de suppression du répertoire {path}.
it: Si è verificata un'eccezione durante il tentativo di eliminare la directory {path}.
ja: ディレクトリ {path} の削除しようとしている間に例外が発生しました。
ko: 디렉터리 {path}을(를) 삭제하려고 시도하는 동안 예외가 발생했습니다.
pl: Wystąpił wyjątek podczas próby usunięcia ścieżki {path} katalogu.
pt_br: Ocorreu uma exceção ao tentar excluir o diretório {path}.
ru: Возникло исключение при попытке удаления каталога {path}.
tr: {path} dizini silinmeye çalışılırken bir özel durum oluştu.
zh_hans: 尝试删除目录 {path} 时发生异常。
zh_hant: 嘗試刪除目錄 {path} 時發生例外狀況。

# FetchedCertificate
source: Fetched certificate. [{milliseconds} ms]
cs: Načetl se certifikát. [{milisekund} ms]
de: Zertifikat abgerufen. [{milliseconds} ms]
es: Certificado capturado. [{milliseconds} ms]
fr: Certificat récupéré. [{milliseconds} ms]
it: Il certificato è stato recuperato. [{milliseconds} ms]
ja: 証明書をフェッチしました。[{milliseconds} ミリ秒]
ko: 인증서를 가져왔습니다. [{milliseconds}ms]
pl: Pobrano certyfikat. [{milliseconds} ms]
pt_br: Certificado buscado. [{milliseconds} ms]
ru: Получен сертификат. [{milliseconds} мс]
tr: Sertifika getirildi. [{milliseconds} ms]
zh_hans: 已提取证书。[{milliseconds} 毫秒]
zh_hant: 已擷取憑證。[{milliseconds} 毫秒]

# FetchingCertificate
source: Fetching certificate from Azure Key Vault.
cs: Načítá se certifikát z Azure Key Vault.
de: Zertifikat wird von Azure Key Vault abgerufen.
es: Capturando certificado de Azure Key Vault.
fr: Récupération du certificat à partir d’Azure Key Vault.
it: Recupero certificato da Azure Key Vault in corso.
ja: Azure Key Vault から証明書をフェッチしています。
ko: Azure Key Vault에서 인증서를 가져오는 중입니다.
pl: Pobieranie certyfikatu z usługi Azure Key Vault.
pt_br: Buscando certificado no Azure Key Vault.
ru: Идет получение сертификата из Azure Key Vault.
tr: Sertifika Azure Key Vault’tan getiriliyor.
zh_hans: 正在从 Azure Key Vault 提取证书。
zh_hant: 正在從 Azure Key Vault 擷取憑證。

# MultiplePrivateKeyContainersError
source: Multiple private key containers provided. Use either /k for user stores or /km for machine stores.
es: Se proporcionaron varios contenedores de clave privada. Use /k para almacenes de usuarios o /km para almacenes de máquinas.
it: Sono stati specificati più contenitori di chiavi private. Utilizzare /k per gli archivi utente o /km per gli archivi computer.
pt_br: Vários contêineres de chave privada fornecidos. Use /k para repositórios de usuários ou /km para repositórios de computadores.

# NoPrivateKeyContainerError
source: Private key container missing while using /csp. Use /k or /km to provide a key container.
es: Falta el contenedor de clave privada al usar /csp. Use /k o /km para proporcionar un contenedor de claves.
it: Contenitore di chiavi private mancante durante l'utilizzo di /csp. Usare /k o /km per specificare un contenitore di chiavi.
pt_br: Contêiner de chave privada ausente ao usar /csp. Use /k ou /km para fornecer um contêiner de chave.

# OpeningContainer
source: Extracting container {ContainerFilePath} to {DirectoryPath}.
cs: Extrahuje se kontejner {ContainerFilePath} do adresáře {DirectoryPath}.
de: Der Container {ContainerFilePath} wird in {DirectoryPath} extrahiert.
es: Extrayendo el contenedor {ContainerFilePath} en {DirectoryPath}.
fr: Extraction du conteneur {ContainerFilePath} vers {DirectoryPath}.
it: Estrazione del contenitore {ContainerFilePath} in {DirectoryPath}.
ja: コンテナー {ContainerFilePath} を {DirectoryPath} に抽出しています。
ko: 컨테이너 {ContainerFilePath}을(를) {DirectoryPath}(으)로 추출하는 중입니다.
pl: Wyodrębnianie ścieżki {ContainerFilePath} kontenera do ścieżki {DirectoryPath}.
pt_br: Extraindo o contêiner {ContainerFilePath} para {DirectoryPath}.
ru: Идет извлечение контейнера {ContainerFilePath} в {DirectoryPath}.
tr: {ContainerFilePath} kapsayıcısı {DirectoryPath} dizinine ayıklanıyor..
zh_hans: 正在将容器 {ContainerFilePath} 提取到 {DirectoryPath}。
zh_hant: 正在將容器 {ContainerFilePath} 解壓縮到 {DirectoryPath}。

# ProcessCouldNotBeKilled
source: {0} timed out and could not be killed.
cs: Vypršel časový limit cesty k {0} a nelze ji ukončit.
de: {0} hat ein Timeout und konnte nicht abgebrochen werden.
es: {0} agotó el tiempo de espera y no se pudo terminar.
fr: {0} a expiré et n’a pas pu être arrêté.
it: Si è verificato il timeout di {0} e non è stato possibile terminarlo.
ja: {0} がタイムアウトしましたが、強制終了できませんでした。
ko: {0}이(가) 시간 초과되어 종료할 수 없습니다.
pl: Przekroczono limit czasu dla ścieżki {0} i nie można jej zabić.
pt_br: {0} atingiu o tempo limite e não pôde ser eliminado.
ru: Время ожидания {0} истекло, и его не удалось завершить.
tr: {0} zaman aşımına uğradı ve sonlandırılamadı.
zh_hans: {0} 超时，无法终止。
zh_hant: {0} 逾時，無法終止。

# ProcessDidNotExitInTime
source: {fileName} took too long to respond. The process exit code is {exitCode}.
es: {fileName} tardó demasiado en responder. El código de salida del proceso es {exitCode}.
it: {fileName} ha impiegato troppo tempo per rispondere. Il codice di uscita del processo è {exitCode}.
ja: {fileName} の応答に時間がかかりすぎました。プロセス終了コードは {exitCode} です。
pt_br: {fileName} demorou muito para responder. O código de saída do processo é {exitCode}.
tr: {fileName} dosyasının yanıt vermesi çok uzun sürdü. İşlem çıkış kodu: {exitCode}.

# ProcessDidNotExitInTimeWithArguments
source: {0} took too long to respond. The process exit code is {1}. Arguments: {2}
cs: Odpověď souboru {0} trvala příliš dlouho,. Ukončovací kód procesu je {1}. Argumenty: {2}
de: {0} hat zu lange gebraucht, um zu antworten. Der Prozessexitcode ist {1}. Argumente: {2}
es: {0} tardó demasiado en responder. El código de salida del proceso es {1}. Argumentos: {2}
fr: {0} a mis trop de temps à répondre. Le code de sortie du processus est {1}. Arguments : {2}
it: {0} ha impiegato troppo tempo per rispondere. Codice di uscita del processo {1}. Argomenti: {2}
ja: {0} の応答に時間がかかりすぎました。プロセス終了コードは {1} です。引数: {2}
ko: {0} 응답하는 데 너무 오래 걸렸습니다. 프로세스 종료 코드는 {1}입니다. 인수: {2}
pl: W przypadku pliku {0} uzyskanie odpowiedzi trwało zbyt długo. Kod zakończenia procesu to {1}. Argumenty: {2}
pt_br: {0} demorou muito para responder. O código de saída do processo {1}. Argumentos: {2}
ru: {0} слишком долго не отвечает. Код завершения процесса {1}. Аргументы: {2}
tr: {0} dosyasının yanıt vermesi çok uzun sürdü. İşlem çıkış kodu: {1}. Bağımsız değişkenler: {2}
zh_hans: {0} 响应的时间太长。进程退出代码为 {1}。参数: {2}
zh_hant: {0} 的回應時間太長。處理序結束代碼為 {1}。引數: {2}

# RunningCli
source: Running {fileName} with parameters: '{args}'.
es: Ejecutando {fileName} con parámetros: '{args}'.
it: Esecuzione di {fileName} con parametri: '{args}'.
ja: パラメーター '{args}' を使用して {fileName} を実行しています。
pt_br: Executando {fileName} com parâmetros: '{args}'.
tr: {fileName} dosyası '{args}' parametreleriyle çalıştırılıyor.

# SavingContainer
source: Rebuilding container {ContainerFilePath} from {DirectoryPath}.
cs: Kontejner {ContainerFilePath} se znovu sestavuje z adresáře {DirectoryPath}.
de: Der Container {ContainerFilePath} wird aus {DirectoryPath} neu erstellt.
es: Recompilando el contenedor {ContainerFilePath} desde {DirectoryPath}.
fr: Reconstruction du conteneur {ContainerFilePath} à partir de {DirectoryPath}.
it: Ricompilazione del contenitore {ContainerFilePath} da {DirectoryPath}.
ja: コンテナー {ContainerFilePath} を {DirectoryPath} から再構築しています。
ko: {DirectoryPath}에서 컨테이너 {ContainerFilePath}을(를) 다시 빌드하는 중입니다.
pl: Ponowne kompilowanie ścieżki {ContainerFilePath} kontenera ze ścieżki {DirectoryPath}.
pt_br: Recriando o contêiner {ContainerFilePath} a partir do {DirectoryPath}.
ru: Идет перестроение контейнера {ContainerFilePath} из {DirectoryPath}.
tr: {ContainerFilePath} kapsayıcısı {DirectoryPath} dizininden yeniden derleniyor.
zh_hans: 正在从 {DirectoryPath} 重新生成容器 {ContainerFilePath}。
zh_hant: 正在從 {DirectoryPath} 重建容器 {ContainerFilePath}。

# SignAsyncCalled
source: SignAsync called for {filePath}. Using {localFilePath} locally.
cs: Byla volána metoda SignAsync pro soubor {filePath}. Používá se {localFilePath} místně.
de: SignAsync wurde für {filePath} aufgerufen. {localFilePath} wird lokal verwendet.
es: Se llamó a SignAsync para {filePath}. Usando {localFilePath} localmente.
fr: SignAsync appelé pour {filePath}. Utilisation locale de {localFilePath}.
it: SignAsync chiamato per {filePath}. Utilizzo di {localFilePath} in locale.
ja: {filePath} に対して SignAsync が呼び出されました。{localFilePath} をローカルで使用しています。
ko: {filePath}에 대해 SignAsync가 호출되었습니다. 로컬에서 {localFilePath}을(를) 사용하고 있습니다.
pl: Wywołano element SignAsync dla ścieżki {filePath}. Używanie ścieżki {localFilePath} lokalnie.
pt_br: SignAsync chamado para {filePath}. Usando {localFilePath} localmente.
ru: SignAsync вызван для {filePath}. Используется {localFilePath} локально.
tr: {filePath} SignAsync çağrıldı. Yerel olarak {localFilePath} kullanılıyor.
zh_hans: 为 {filePath} 调用了 SignAsync。请在本地使用 {localFilePath}。
zh_hant: 已針對 {filePath} 呼叫 SignAsync。正在本機使用 {localFilePath}。

# SigningAttempt
source: Performing attempt #{attempt} of {maxAttempts} attempts after {seconds} s.
cs: Probíhá pokus #{attempt} z {maxAttempts} pokusů po {seconds} s.
de: Der Versuch #{attempt} von {maxAttempts} Versuchen wird nach {seconds} Sek. ausgeführt.
es: Realizando el intento #{attempt} de {maxAttempts} intentos después de {seconds} s.
fr: Exécution de la tentative n° {attempt} sur {maxAttempts} après {seconds} s.
it: Esecuzione del tentativo #{attempt} di {maxAttempts} tentativi dopo {seconds} s.
ja: {seconds} 秒後に {maxAttempts} 回の試行のうち #{attempt} 回目の試行を実行しています。
ko: {seconds}초 후에 {maxAttempts}회 시도 중 #{attempt}을(를) 시도하는 중입니다.
pl: Wykonywanie #{attempt} próby z {maxAttempts} po {seconds} s.
pt_br: Executando a tentativa #{attempt} de {maxAttempts} tentativas após {seconds} s.
ru: Выполняется попытка #{attempt} из {maxAttempts} попыток за {seconds} с.
tr: {seconds} sn sonra #{attempt}/{maxAttempts} deneme yapılıyor.
zh_hans: 正在 {seconds} 秒后执行第 #{attempt} 次尝试(最多 {maxAttempts} 次)。
zh_hant: 在 {seconds} 秒後執行 {maxAttempts} 次嘗試的第 attempt #{attempt} 次嘗試。

# SigningFailed
source: Could not sign {0}.
cs: Nelze podepsat {0}{0}.
de: {0} konnte nicht signiert werden.
es: No se pudo firmar {0}.
fr: Impossible de signer {0}.
it: Non è stato possibile accedere a {0}.
ja: {0} に署名できませんでした。
ko: {0}에 서명할 수 없습니다.
pl: Nie można podpisać ścieżki {0}.
pt_br: Não foi possível autenticar {0}.
ru: Не удалось подписать {0}.
tr: {0} imzalamadı.
zh_hans: 无法对 {0} 进行签名。
zh_hant: 無法簽署 {0}。

# SigningFailedAfterAllAttempts
source: Failed to sign. Attempts exceeded.
cs: Nepovedlo se podepsat. Počet pokusů byl překročen.
de: Fehler beim Signieren. Versuche wurden überschritten.
es: No se pudo firmar. Intentos superados.
fr: Échec de la signature. Tentatives dépassées.
it: Firma non riuscita. Tentativi superati.
ja: 署名できませんでした。試行回数を超えました。
ko: 서명하지 못했습니다. 시도 횟수를 초과했습니다.
pl: Nie można podpisać. Przekroczono liczbę prób.
pt_br: Falha ao autenticar. Tentativas excedidas.
ru: Не удалось подписать. Превышено количество попыток.
tr: İmzalanamadı. Deneme sayısı aşıldı.
zh_hans: 签名失败。超过了尝试次数。
zh_hant: 無法簽署。超過嘗試次數。

# SigningFailedWithError
source: Signing failed with error {errorCode}.
cs: Podepisování selhalo s chybou {errorCode}.
de: Das Signieren ist mit Fehler {errorCode} fehlgeschlagen.
es: Error al firmar: {errorCode}.
fr: Échec de la signature avec l’erreur {errorCode}.
it: Firma non riuscita con errore {errorCode}.
ja: 署名がエラー {errorCode} で失敗しました。
ko: 오류 {errorCode}(으)로 인해 서명에 실패했습니다.
pl: Podpisywanie nie powiodło się z powodu błędu {errorCode}.
pt_br: Falha na autenticação com o erro {errorCode}.
ru: Сбой подписывания с ошибкой {errorCode}.
tr: İmzalama {errorCode} hatasıyla başarısız oldu.
zh_hans: 签名失败，出现错误 {errorCode}。
zh_hant: 簽署失敗。錯誤 {errorCode}。

# SigningFile
source: Signing {filePath}.
cs: Podepisování souboru {filePath}
de: {filePath} wird signiert.
es: Firmando {filePath}.
fr: Signature de {filePath}.
it: Firma di {filePath} in corso.
ja: {filePath} に署名しています。
ko: {filePath}에 서명하는 중입니다.
pl: Podpisywanie ścieżki {filePath}.
pt_br: Autenticando {filePath}.
ru: Подписывание {filePath}.
tr: {filePath} imzalanıyor.
zh_hans: 正在对 {filePath} 进行签名。
zh_hant: 正在簽署 {filePath}。

# SigningSucceeded
source: Signing {filePath} succeeded.
es: Se firmó {filePath} correctamente.
it: Firma di {filePath} completata.
pt_br: A assinatura do {filePath} foi bem-sucedida.

# SigningSucceededWithTimeElapsed
source: Completed in {millseconds} ms.
es: Completado en {millseconds} ms.
it: Completato in {millseconds} ms.
ja: {millseconds} ミリ秒で完了しました
pt_br: Concluído em {millseconds} ms.
tr: {millseconds} ms içinde tamamlandı.

# SubmittingFileForSigning
source: Submitting {filePath} for signing.
cs: Odesílá se soubor {filePath} pro podepisování.
de: {filePath} wird zum Signieren übermittelt.
es: Enviando {filePath} para la firma.
fr: Envoi de {filePath} pour signature.
it: Invio {filePath} per la firma.
ja: 署名のために {filePath} を送信しています。
ko: 서명을 위해 {filePath}을(를) 제출하는 중입니다.
pl: Przesyłanie ścieżki {filePath} do podpisania.
pt_br: Enviando {filePath} para autenticação.
ru: Отправка {filePath} для подписывания.
tr: {filePath} imzalama için gönderiliyor.
zh_hans: 正在提交 {filePath} 进行签名。
zh_hant: 正在提交 {filePath} 進行簽署。

# UnsupportedPublicKeyAlgorithm
source: The certificate has an unsupported public key algorithm.
es: El certificado tiene un algoritmo de clave pública no admitido.
it: Il certificato contiene un algoritmo a chiave pubblica non supportato.
pt_br: O certificado tem um algoritmo de chave pública sem suporte.

# VSIXSignToolOpcContentTypeInvalid
source: Specified {0} is invalid.
es: El modo {0} especificado no es válido.
it: {0} specificato non valido.
pt_br: O {0} especificado é inválido.

# VSIXSignToolUnknownSigningAlgorithm
source: Unknown signing algorithm.
es: Algoritmo de firma desconocido.
it: Algoritmo di firma sconosciuto.
pt_br: Algoritmo de assinatura desconhecido.

# VSIXSignToolUnsupportedAlgorithm
source: The algorithm selected is not supported.
es: No se admite el algoritmo seleccionado.
it: L'algoritmo selezionato non è supportato.
pt_br: O algoritmo selecionado não tem suporte.

# ValueCannotBeEmptyString
source: The value cannot be an empty string.
cs: Hodnota nemůže být prázdný řetězec.
de: Der Wert darf keine leere Zeichenfolge sein.
es: El valor no puede ser una cadena vacía.
fr: La valeur ne peut pas être une chaîne vide.
it: Il valore non può essere una stringa vuota.
ja: 値を空の文字列にすることはできません。
ko: 값은 빈 문자열일 수 없습니다.
pl: Wartość nie może być ciągiem pustym.
pt_br: O valor não pode ser uma cadeia de caracteres vazia.
ru: Значение не может быть пустой строкой.
tr: Değer boş bir dize olamaz.
zh_hans: 值不能为空字符串。
zh_hant: 值不可為空字串。

# VsixSignatureProviderSigning
source: Signing VsixSignTool job with {count} files.
es: Firmando el trabajo de VsixSignTool con {count} archivos.
it: Firma del processo VsixSignTool con {count} file.
pt_br: Assinando o trabalho VsixSignTool com {count} arquivos.

source: Signing succeeded.
cs: Podepisování proběhlo úspěšně.
de: Das Signieren war erfolgreich.
fr: Signature réussie.
ja: 署名に成功しました。
ko: 서명에 성공했습니다.
pl: Podpisywanie powiodło się.
ru: Подписывание выполнено успешно.
tr: İmzalama başarılı oldu.
zh_hans: 签名成功。
zh_hant: 簽署成功。
