Repository: dotnet/sign
Catalog: src/Sign.Cli/xlf/AzureKeyVaultResources.*.xlf
Languages: cs, es, fr, it, ja, ko, pl, pt_br, ru, zh_hans

# CertificateOptionDescription
source: Name of the certificate in Azure Key Vault.
cs: Název certifikátu v Azure Key Vault.
es: Nombre del certificado en Azure Key Vault.
fr: Nom du certificat dans Azure Key Vault.
it: Nome del certificato in Azure Key Vault.
ja: Azure Key Vault 内の証明書の名前。
ko: Azure Key Vault의 인증서 이름입니다.
pl: Nazwa certyfikatu w usłudze Azure Key Vault.
pt_br: Nome do certificado no Azure Key Vault.
ru: Имя сертификата в Azure Key Vault.
zh_hans: Azure Key Vault 中的证书名称。

# ClientIdOptionDescription
source: Client ID to authenticate to Azure Key Vault.
cs: ID klienta, které se má ověřit pro Azure Key Vault.
es: Id. de cliente para autenticarse en Azure Key Vault.
fr: ID client à authentifier auprès d’Azure Key Vault.
it: ID client da autenticare in Azure Key Vault.
ja: Azure Key Vault に対して認証するクライアント ID。
ko: Azure Key Vault에 인증하기 위한 클라이언트 ID입니다.
pl: Identyfikator klienta do uwierzytelnienia w usłudze Azure Key Vault.
pt_br: ID do cliente a ser autenticada no Azure Key Vault.
ru: ИД клиента для проверки подлинности в Azure Key Vault.
zh_hans: 要向 Azure Key Vault 进行身份验证的客户端 ID。

# ClientSecretOptionDescription
source: Client secret to authenticate to Azure Key Vault.
cs: Tajný kód klienta, který se má ověřit pro Azure Key Vault.
es: Secreto de cliente para autenticarse en Azure Key Vault.
fr: Clé secrète client pour s’authentifier auprès d’Azure Key Vault.
it: Segreto client da autenticare in Azure Key Vault.
ja: Azure Key Vault に対して認証するクライアント シークレット。
ko: Azure Key Vault에 인증하기 위한 클라이언트 암호입니다.
pl: Klucz tajny klienta do uwierzytelnienia w usłudze Azure Key Vault.
pt_br: Segredo do cliente a ser autenticado no Azure Key Vault.
ru: Секрет клиента для проверки подлинности в Azure Key Vault.
zh_hans: 要向 Azure Key Vault 进行身份验证的客户端密码。

# CommandDescription
source: Use Azure Key Vault.
cs: Použijte Azure Key Vault.
fr: Utilisez Azure Key Vault.
it: Usare Azure Key Vault.
ja: Azure Key Vault を使用してください。
ko: Azure Key Vault를 사용합니다.
pl: Użyj usługi Azure Key Vault.
pt_br: Use o Azure Key Vault.
ru: Использование Azure Key Vault.
zh_hans: 使用 Azure Key Vault。

# FilesArgumentDescription
source: File(s) to sign.
cs: Soubor nebo soubory, které se mají podepsat.
es: Archivos para firmar.
fr: Fichier(s) à signer.
it: File da firmare.
ja: 署名するファイル。
ko: 서명할 파일입니다.
pl: Pliki do podpisania.
pt_br: Arquivo(s) para autenticar.
ru: Файлы для подписи.
zh_hans: 要签名的文件。

# InvalidBaseDirectoryValue
source: Invalid value for {0}. The value must be a fully rooted directory path.
cs: Neplatná hodnota pro {0}. Hodnota musí být plně kořenová cesta k adresáři.
es: Valor no válido para {0}. El valor debe ser una ruta de acceso de directorio totalmente raíz.
fr: Valeur non valide pour {0}. La valeur doit être un chemin d’accès de répertoire entièrement rooté.
it: Valore non valido per {0}. Il valore deve essere un percorso di directory completo.
ja: {0} の値が無効です。値は、完全にルート化されたディレクトリ パスである必要があります。
ko: {0}에 대한 값이 잘못되었습니다. 값은 완전한 루트 디렉터리 경로여야 합니다.
pl: Nieprawidłowa wartość dla {0}. Wartość musi być w pełni główną ścieżką katalogu.
pt_br: Valor inválido para {0}. O valor deve ser um caminho de diretório totalmente desbloqueado por rooting.
ru: Недопустимое значение для {0}. Значение должно быть полным корневым путем к каталогу.
zh_hans: {0} 的值无效。该值必须是完整的根目录路径。

# InvalidClientSecretCredential
source: If not using a managed identity, all of these options are required: {0}, {1}, and {2}.
cs: Pokud se nepoužívá spravovaná identita, vyžadují se všechny tyto možnosti: {0}, {1}a {2}.
es: Si no usa una identidad administrada, se requieren todas estas opciones: {0}, {1} y {2}.
fr: Si vous n’utilisez pas d’identité managée, toutes ces options sont requises : {0}, {1} et {2}.
it: Se non si usa un'identità gestita, saranno necessarie tutte le opzioni seguenti: {0}, {1} e {2}.
ja: マネージド ID を使用しない場合は、{0}、{1}、{2} のオプションがすべて必要です。
ko: 관리 ID를 사용하고 있지 않은 경우 {0}, {1} 및 {2} 옵션이 모두 필요합니다.
pl: Jeśli tożsamość zarządzana nie jest używana, wymagane są wszystkie następujące opcje: {0}, {1} i {2}.
pt_br: Se não estiver usando uma identidade gerenciada, todas essas opções serão necessárias: {0}, {1} e {2}.
ru: Если управляемое удостоверение не используется, требуются все следующие параметры: {0}, {1} и {2}.
zh_hans: 如果不使用托管标识，则需要以下所有选项: {0}、{1} 和 {2}。

# InvalidFileValue
source: The file path cannot be rooted when using a glob. Use a path relative to the working directory (or base directory, if used).
cs: Cestu k souboru nelze při použití glob zakořenit. Použijte relativní cestu k pracovnímu adresáři (nebo základnímu adresáři, pokud se používá).
es: La ruta de acceso del archivo no se puede rootear cuando se usa un glob. Use una ruta de acceso relativa al directorio de trabajo (o directorio base, si se usa).
fr: Le chemin d’accès du fichier ne peut pas être rooté lors de l’utilisation d’un glob. Utilisez un chemin d’accès relatif au répertoire de travail (ou au répertoire de base, s’il est utilisé).
it: Il percorso del file non può avere accesso root quando si utilizza un GLOB. Usare un percorso relativo alla directory di lavoro (o alla directory di base, se usata).
ja: glob を使用している場合、ファイル パスをルート化できません。作業ディレクトリへの相対パス (または使用されている場合はベース ディレクトリ) を使用してください。
ko: glob을 사용할 때 파일 경로를 루팅할 수 없습니다. 작업 디렉터리(또는 사용되는 경우 기본 디렉터리)에 상대적인 경로를 사용하세요.
pl: Ścieżka pliku nie może być z dostępem do konta root, gdy jest używany element globalny. Użyj ścieżki odnoszącej się do katalogu roboczego (lub katalogu podstawowego, jeśli jest używany).
pt_br: O caminho do arquivo não pode estar desbloqueado por rooting ao usar um glob. Use um caminho relativo ao diretório de trabalho (ou diretório base, se usado).
ru: Путь к файлу не может быть корневым при использовании стандартной маски. Используйте путь относительно рабочего каталога (или базового каталога, если он используется).
zh_hans: 使用 glob 时，文件路径不能为根路径。请使用相对于工作目录(或基目录，如果使用)的路径。

# ManagedIdentityOptionDescription
source: Managed identity to authenticate to Azure Key Vault.
cs: Spravovaná identita pro ověření pro Azure Key Vault.
es: Identidad administrada para autenticarse en Azure Key Vault.
fr: Identité managée à authentifier auprès d’Azure Key Vault.
it: Identità gestita da autenticare in Azure Key Vault.
ja: Azure Key Vault に対して認証するマネージド ID。
ko: Azure Key Vault에 인증하기 위한 관리 ID입니다.
pl: Tożsamość zarządzana do uwierzytelnienia w usłudze Azure Key Vault.
pt_br: Identidade gerenciada a ser autenticada no Azure Key Vault.
ru: Управляемое удостоверение для проверки подлинности в Azure Key Vault.
zh_hans: 要向 Azure Key Vault 进行身份验证的托管标识。

# MissingFileValue
source: A file or glob is required.
cs: Vyžaduje se soubor nebo glob.
es: Se requiere un archivo o glob.
fr: Un fichier ou un glob est requis.
it: È necessario specificare un file o un GLOB.
ja: ファイルまたは glob が必要です。
ko: 파일 또는 글로브가 필요합니다.
pl: Wymagany jest plik lub element globalny.
pt_br: É necessário um arquivo ou um glob.
ru: Требуется файл или стандартная маска.
zh_hans: 文件或 glob 是必需的。

# NoFilesToSign
source: No inputs found to sign.
cs: Nenašly se žádné vstupy, které by bylo možné podepsat.
es: No se encontraron entradas para firmar.
fr: Aucune entrée à signer.
it: Non sono stati trovati input da firmare.
ja: 署名する入力が見つかりません。
ko: 서명할 입력이 없습니다.
pl: Nie znaleziono danych wejściowych do podpisania.
pt_br: Nenhuma entrada encontrada para autenticar.
ru: Не найдены входящие данные для подписи.
zh_hans: 找不到要签名的输入。

# SomeFilesDoNotExist
source: Some files do not exist. Try using a different {0} value or a fully qualified file path.
cs: Některé soubory neexistují. Zkuste použít jinou hodnotu {0} nebo plně kvalifikovanou cestu k souboru.
es: Algunos archivos no existen. Pruebe a usar otro valor {0} o una ruta de acceso de archivo completa.
fr: Certains fichiers n’existent pas. Essayez d’utiliser une autre valeur {0} ou un chemin de fichier complet.
it: Alcuni file non esistono. Provare a usare un valore di {0} diverso o un percorso di file completo.
ja: 一部のファイルが存在しません。別の {0} 値または完全修飾ファイル パスを使用してみてください。
ko: 일부 파일이 존재하지 않습니다. 다른 {0} 값 또는 정규화된 파일 경로를 사용해 보세요.
pl: Niektóre pliki nie istnieją. Spróbuj użyć innej wartości {0} lub w pełni kwalifikowanej ścieżki pliku.
pt_br: Alguns arquivos não existem. Tente usar um valor diferente de {0} ou um caminho de arquivo totalmente qualificado.
ru: Некоторые файлы не существуют. Попробуйте использовать другое значение {0} или полный путь к файлу.
zh_hans: 某些文件不存在。请尝试使用其他 {0} 值或完全限定的文件路径。

# TenantIdOptionDescription
source: Tenant ID to authenticate to Azure Key Vault.
cs: ID tenanta, které se má ověřit pro Azure Key Vault.
es: Identificador de inquilino para autenticarse en Azure Key Vault.
fr: ID client pour s’authentifier auprès d’Azure Key Vault.
it: ID tenant da autenticare in Azure Key Vault.
ja: Azure Key Vault に対して認証するテナント ID。
ko: Azure Key Vault에 인증하기 위한 테넌트 ID입니다.
pl: Identyfikator dzierżawy do uwierzytelnienia w usłudze Azure Key Vault.
pt_br: ID do locatário a ser autenticada no Azure Key Vault.
ru: ИД клиента для проверки подлинности в Azure Key Vault.
zh_hans: 要向 Azure Key Vault 进行身份验证的租户 ID。

# UrlOptionDescription
source: URL to an Azure Key Vault.
cs: Adresa URL Azure Key Vault.
es: Dirección URL a un Azure Key Vault.
fr: URL d’un Azure Key Vault.
it: URL a un Azure Key Vault.
ja: Azure Key Vault への URL。
ko: Azure Key Vault에 대한 URL입니다.
pl: Adres URL do usługi Azure Key Vault.
pt_br: URL para um Azure Key Vault.
ru: URL-адрес для Azure Key Vault.
zh_hans: 指向 Azure Key Vault 的 URL。
