Repository: dotnet/sign
Catalog: src/Sign.Cli/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ApplicationNameOptionDescription
source: Application name (ClickOnce).
cs: Název aplikace (ClickOnce).
de: Anwendungsname (ClickOnce).
es: Nombre de la aplicación (ClickOnce).
fr: Nom de l’application (ClickOnce).
it: Nome applicazione (ClickOnce).
ja: アプリケーション名 (ClickOnce)。
ko: 애플리케이션 이름(ClickOnce).
pl: Nazwa aplikacji (ClickOnce).
pt_br: Nome do aplicativo (ClickOnce).
ru: Имя приложения (ClickOnce).
tr: Uygulama adı (ClickOnce).
zh_hans: 应用程序名称(ClickOnce)。
zh_hant: 應用程式名稱 (ClickOnce)。

# BaseDirectoryOptionDescription
source: Base directory for files. Overrides the current working directory.
cs: Základní adresář pro soubory Přepíše aktuální pracovní adresář.
de: Basisverzeichnis für Dateien. Überschreibt das aktuelle Arbeitsverzeichnis.
es: Directorio base para los archivos. Invalida el directorio de trabajo actual.
fr: Répertoire de base pour les fichiers. Remplace le répertoire de travail actuel.
it: Directory di base per i file. Esegue l'override della directory di lavoro corrente.
ja: ファイルのベース ディレクトリ。 現在の作業ディレクトリをオーバーライドします。
ko: 파일의 기본 디렉터리입니다. 현재 작업 디렉터리를 재정의합니다.
pl: Katalog podstawowy dla plików. Zastępuje bieżący katalog roboczy.
pt_br: Diretório base para arquivos. Substitui o diretório de trabalho atual.
ru: Базовый каталог для файлов. Переопределяет текущий рабочий каталог.
tr: Dosyalar için temel dizin. Geçerli çalışma dizinini geçersiz kılar.
zh_hans: 文件的基目录。替代当前工作目录。
zh_hant: 檔案的基底目錄。覆寫目前的工作目錄。

# CertificateStoreCommandDescription
source: Use Windows Certificate Store or a local certificate file.
cs: Použijte úložiště certifikátů systému Windows nebo místní soubor certifikátu.
de: Verwenden Sie den Windows-Zertifikatspeicher oder eine lokale Zertifikatdatei.
es: Use el Almacén de certificados de Windows o un archivo de certificados local.
fr: Utilisez le magasin de certificats Windows ou un fichier local du certificat.
it: Utilizzare l'archivio certificati di Windows o un file di certificato locale.
ja: Windows 証明書ストアまたはローカル証明書ファイルを使用します。
ko: Windows 인증서 저장소 또는 로컬 인증서 파일을 사용합니다.
pl: Użyj magazynu certyfikatów systemu Windows lub lokalnego pliku certyfikatów.
pt_br: Use o Repositório de Certificados do Windows ou um arquivo de certificado local.
tr: Windows Sertifika Deposu veya yerel bir sertifika dosyası kullanın.
zh_hant: 使用 Windows 憑證存放區或本機憑證檔案。

# ClientIdOptionDescription
source: Client ID to authenticate to Azure.
cs: ID klienta pro ověření v Azure.
de: Client-ID für die Authentifizierung bei Azure.
es: Id. de cliente para autenticarse en Azure.
fr: ID client pour l’authentification auprès d’Azure.
it: ID client da autenticare in Azure.
ko: Azure에 인증할 클라이언트 ID입니다.
pl: Identyfikator klienta do uwierzytelniania na platformie Azure.
pt_br: ID do cliente a ser autenticada no Azure.
tr: Azure için kimlik doğrulamak amacıyla kullanılan istemci kimliği.
zh_hant: 要向 Azure 進行驗證的用戶端識別碼。

# ClientSecretOptionDescription
source: Client secret to authenticate to Azure.
cs: Tajný kód klienta pro ověření v Azure.
de: Geheimer Clientschlüssel für die Authentifizierung bei Azure.
es: Secreto de cliente para autenticarse en Azure.
fr: Clé secrète client pour s’authentifier auprès d’Azure.
it: Segreto client da autenticare in Azure.
ko: Azure에 인증하는 클라이언트 암호입니다.
pl: Klucz tajny klienta do uwierzytelniania na platformie Azure.
pt_br: Segredo do cliente a ser autenticado no Azure.
tr: Azure için kimlik doğrulamak amacıyla kullanılan gizli anahtar.
zh_hant: 要向 Azure 進行驗證的用戶端密碼。

# ClientSecretOptionsObsolete
source: The client secret options are obsolete and should no longer be specified.
cs: Možnosti tajného kódu klienta jsou zastaralé a již by neměly být zadány.
de: Die Optionen für geheime Clientschlüssel sind veraltet und sollten nicht mehr angegeben werden.
es: Las opciones de secreto de cliente están obsoletas y ya no deben especificarse.
fr: Les options de secret du client sont obsolètes et ne doivent plus être spécifiées.
it: Le opzioni del segreto client sono obsolete e non devono essere più specificate.
ko: 클라이언트 비밀 옵션은 사용되지 않으므로 더 이상 지정하지 않아야 합니다.
pl: Opcje klucza tajnego klienta są przestarzałe i nie należy ich już określać.
pt_br: As opções de segredo do cliente são obsoletas e não devem mais ser especificadas.
tr: Gizli anahtar seçenekleri kullanımdan kaldırıldı ve artık belirtilmemelidir.

# CodeCommandDescription
source: Sign binaries and containers.
cs: Podepisovat binární soubory a kontejnery.
de: Signieren Sie Binärdateien und Container.
es: Firmar archivos binarios y contenedores.
fr: Signer les fichiers binaires et les conteneurs.
it: Consente di firmare file binari e contenitori.
ja: バイナリとコンテナーに署名します。
ko: 이진 파일 및 컨테이너에 서명합니다.
pl: Podpisz pliki binarne i kontenery.
pt_br: Autenticar contêineres e binários.
ru: Подписывание двоичных файлов и контейнеров.
tr: İkili dosyaları ve kapsayıcıları imzalayın.
zh_hans: 对二进制文件和容器进行签名。
zh_hant: 簽署二進位檔和容器。

# DescriptionOptionDescription
source: Description of the signing certificate.
cs: Popis podpisového certifikátu.
de: Beschreibung des Signaturzertifikats.
es: Descripción del certificado de firma.
fr: Description du certificat de signature.
it: Descrizione del certificato di firma.
ja: 署名証明書の説明。
ko: 서명 인증서에 대한 설명입니다.
pl: Opis certyfikatu podpisywania.
pt_br: Descrição do certificado de autenticação.
ru: Описание сертификата для подписи
tr: İmzalama sertifikasının açıklaması.
zh_hans: 签名证书的说明。
zh_hant: 簽署憑證的描述。

# DescriptionUrlOptionDescription
source: Description URL of the signing certificate.
cs: Popis adresy URL podpisového certifikátu.
de: Beschreibungs-URL des Signaturzertifikats.
es: Descripción de URL del certificado de firma.
fr: URL de description du certificat de signature.
it: URL descrizione del certificato di firma.
ja: 署名証明書の説明 URL。
ko: 서명 인증서의 설명 URL입니다.
pl: Adres URL opisu certyfikatu podpisywania.
pt_br: URL de descrição do certificado de autenticação.
ru: Описание URL-адреса сертификата для подписи
tr: İmzalama sertifikasının açıklama URL’si.
zh_hans: 签名证书的说明 URL。
zh_hant: 簽署憑證的描述 URL。

# FileDigestOptionDescription
source: Digest algorithm to hash files with. Allowed values are 'sha256', 'sha384', and 'sha512'.
cs: Algoritmus hodnoty hash pro hash souborů. Povolené hodnoty jsou sha256, sha384 a sha512.
de: Digestalgorithmus zum Hashen von Dateien. Zulässige Werte sind "sha256", "sha384" und "sha512".
es: Algoritmo de resumen con el que se van a aplicar algoritmos hash a los archivos. Los valores permitidos son 'sha256', 'sha384', y 'sha512'.
fr: Algorithme Digest pour hacher les fichiers avec. Les valeurs autorisées sont 'sha256', 'sha384' et 'sha512'.
it: Algoritmo di digest con cui eseguire l'hashing dei file. I valori consentiti sono 'sha256', 'sha384' e 'sha512'.
ja: ファイルのハッシュに使用するダイジェスト アルゴリズム。使用できる値は、'sha256'、'sha384'、および 'sha512' です。
ko: 파일을 해시하는 다이제스트 알고리즘입니다. 허용되는 값은 'sha256', 'sha384' 및 'sha512'입니다.
pl: Algorytm skrótu, za pomocą którego jest tworzony skrót plików. Dozwolonymi wartościami są: „sha256”, „sha384”, lub „sha512”.
pt_br: Algoritmo de código hash para arquivos de hash. Os valores permitidos são 'sha256', 'sha384' e 'sha512'.
ru: Алгоритм дайджеста для хэширования файлов. Допустимые значения: "sha256", "sha384" и "sha512".
tr: Dosyaların karmasını oluşturmak için kullanılan karma algoritması. İzin verilen değerler şunlardır: 'sha256', 'sha384' ve 'sha512'.
zh_hans: 用于对文件进行哈希处理的摘要算法。允许的值为 "sha256"、"sha384" 和 "sha512"。
zh_hant: 用於雜湊檔案的摘要演算法。允許的值為 'sha256'、'sha384' 和 'sha512'。

# FileListOptionDescription
source: Path to file containing paths of files to sign or to exclude from signing.
cs: Cesta k souboru obsahujícímu cesty k souborům, které se mají podepsat nebo vyloučit z podepisování.
de: Pfad zur Datei mit Pfaden von Dateien, die signiert oder von der Signierung ausgeschlossen werden sollen.
es: Ruta de acceso al archivo que contiene las rutas de acceso de los archivos que se van a firmar o que se van a excluir de la firma.
fr: Chemin du fichier contenant les chemins des fichiers à signer ou à exclure de la signature.
it: Percorso del file contenente i percorsi dei file da firmare o escludere dalla firma.
ja: 署名するファイルまたは署名から除外するファイルのパスを含むファイルへのパス。
ko: 서명하거나 서명에서 제외할 파일의 경로가 포함된 파일 경로입니다.
pl: Ścieżka do pliku zawierającego ścieżki plików do podpisania lub wykluczenia z podpisywania.
pt_br: Caminho para o arquivo que contém os caminhos dos arquivos a serem assinados ou excluídos da assinatura.
tr: İmzalanacak veya imzalamadan dışlanacak dosyaların yollarını içeren dosya yolu.
zh_hant: 包含要簽署或從簽署排除之檔案路徑的檔案路徑。

# FilesArgumentDescription
source: File(s) to sign.
cs: Soubor nebo soubory, které se mají podepsat.
de: Zu signierende Datei(en).
es: Archivos para firmar.
fr: Fichier(s) à signer.
it: File da firmare.
ja: 署名するファイル。
ko: 서명할 파일입니다.
pl: Pliki do podpisania.
pt_br: Arquivo(s) para autenticar.
tr: İmzalanacak dosyalar.
zh_hant: 要簽署的檔案。

# InvalidBaseDirectoryValue
source: Invalid value for {0}. The value must be a fully rooted directory path.
cs: Neplatná hodnota pro {0}. Hodnota musí být plně kořenová cesta k adresáři.
de: Ungültiger Wert für {0}. Der Wert muss ein vollständiger Stammverzeichnispfad sein.
es: Valor no válido para {0}. El valor debe ser una ruta de acceso de directorio totalmente raíz.
fr: Valeur non valide pour {0}. La valeur doit être un chemin d’accès de répertoire entièrement rooté.
it: Valore non valido per {0}. Il valore deve essere un percorso di directory completo.
ja: {0} の値が無効です。値は、完全にルート化されたディレクトリ パスである必要があります。
ko: {0}에 대한 값이 잘못되었습니다. 값은 완전한 루트 디렉터리 경로여야 합니다.
pl: Nieprawidłowa wartość dla {0}. Wartość musi być w pełni główną ścieżką katalogu.
pt_br: Valor inválido para {0}. O valor deve ser um caminho de diretório totalmente desbloqueado por rooting.
ru: Недопустимое значение для {0}. Значение должно быть полным корневым путем к каталогу.
tr: {0} için geçersiz değer. Değer, tam olarak kök erişim izni verilmiş bir dizin yolu olmalıdır.
zh_hans: {0} 的值无效。该值必须是完整的根目录路径。
zh_hant: {0} 的值無效。值必須是完整的根目錄路徑。

# InvalidCertificateFingerprintValue
source: Invalid value for {0}. The value must be a SHA-256, SHA-384, or SHA-512 certificate fingerprint (in hexadecimal).
cs: Neplatná hodnota pro {0}. Hodnotou musí být otisk certifikátu SHA-256, SHA-384 nebo SHA-512 (v šestnáctkovém tvaru).
de: Ungültiger Wert für {0}. Der Wert muss ein SHA-256-, SHA-384- oder SHA-512-Zertifikatfingerabdruck (hexadezimal) sein.
es: Valor no válido para {0}. El valor debe ser una huella de certificado SHA-256, SHA-384 o SHA-512 (en hexadecimal).
fr: Valeur non valide pour {0}. La valeur doit être une empreinte digitale de certificat SHA-256, SHA-384 ou SHA-512 (en hexadécimal).
it: Valore non valido per {0}. Il valore deve essere un’impronta digitale del certificato SHA-256, SHA-384 o SHA-512 (in formato esadecimale).
ja: {0} の値が無効です。値は SHA-256、SHA-384、または SHA-512 証明書フィンガープリント (16 進数) である必要があります。
ko: {0}의 값이 잘못되었습니다. 값은 SHA-256, SHA-384 또는 SHA-512 인증서 지문(16진수)이어야 합니다.
pl: Nieprawidłowa wartość dla algorytmu {0}. Wartość musi być odciskiem palca certyfikatu z algorytmem SHA-256, SHA-384 lub SHA-512 (w formacie szesnastkowym).
pt_br: Valor inválido para {0}. O valor deve ser uma impressão digital de certificado SHA-256, SHA-384 ou SHA-512 (em hexadecimal).
tr: {0} için geçersiz değer. Değer bir SHA-256, SHA-384 veya SHA-512 sertifikası parmak izi (onaltılı olarak) olmalıdır.
zh_hant: {0} 的值無效。該值必須是 SHA-256、SHA-384 或 SHA-512 憑證指紋 (十六進位格式)。

# InvalidDigestValue
source: Invalid value for {0}. The value must be 'sha256', 'sha384', or 'sha512'.
cs: Neplatná hodnota pro {0}. Hodnota musí být sha256, sha384 nebo sha512.
de: Ungültiger Wert für {0}. Der Wert muss "sha256", "sha384" oder "sha512" sein.
es: Valor no válido para {0}. El valor debe ser 'sha256', 'sha384' o 'sha512'.
fr: Valeur invalide pour {0}. La valeur doit être 'sha256', 'sha384' ou 'sha512'.
it: Valore non valido per {0}. Il valore deve essere 'sha256', 'sha384' o 'sha512'.
ja: {0} の値が無効です。値は 'sha256'、'sha384'、または 'sha512' である必要があります。
ko: {0}에 대한 값이 잘못되었습니다. 값은 'sha256', 'sha384' 또는 'sha512'.여야 합니다.
pl: Nieprawidłowa wartość dla {0}. Wartością musi być „sha256”, „sha384”, lub „sha512”.
pt_br: Valor inválido para {0}. O valor deve ser 'sha256', 'sha384' ou 'sha512'.
ru: Недопустимое значение для {0}. Необходимо использовать "sha256", "sha384" или "sha512".
tr: {0} için geçersiz değer. Değer 'sha256', 'sha384' veya 'sha512' olmalıdır.
zh_hans: {0} 的值无效。值必须为 "sha256"、"sha384" 或 "sha512"。
zh_hant: {0} 的值無效。值必須是 'sha256'、'sha384' 或 'sha512'。

# InvalidFileValue
source: The file path cannot be rooted when using a glob. Use a path relative to the working directory (or base directory, if used).
cs: Cestu k souboru nelze při použití glob zakořenit. Použijte relativní cestu k pracovnímu adresáři (nebo základnímu adresáři, pokud se používá).
de: Der Dateipfad kann keinem Stamm zugewiesen werden, wenn ein Glob verwendet wird. Verwenden Sie einen Pfad relativ zum Arbeitsverzeichnis (oder Basisverzeichnis, falls verwendet).
es: La ruta de acceso del archivo no se puede rootear cuando se usa un glob. Use una ruta de acceso relativa al directorio de trabajo (o directorio base, si se usa).
fr: Le chemin d’accès du fichier ne peut pas être rooté lors de l’utilisation d’un glob. Utilisez un chemin d’accès relatif au répertoire de travail (ou au répertoire de base, s’il est utilisé).
it: Il percorso del file non può avere accesso root quando si utilizza un GLOB. Usare un percorso relativo alla directory di lavoro (o alla directory di base, se usata).
ja: glob を使用している場合、ファイル パスをルート化できません。作業ディレクトリへの相対パス (または使用されている場合はベース ディレクトリ) を使用してください。
ko: glob을 사용할 때 파일 경로를 루팅할 수 없습니다. 작업 디렉터리(또는 사용되는 경우 기본 디렉터리)에 상대적인 경로를 사용하세요.
pl: Ścieżka pliku nie może być z dostępem do konta root, gdy jest używany element globalny. Użyj ścieżki odnoszącej się do katalogu roboczego (lub katalogu podstawowego, jeśli jest używany).
pt_br: O caminho do arquivo não pode estar desbloqueado por rooting ao usar um glob. Use um caminho relativo ao diretório de trabalho (ou diretório base, se usado).
tr: Glob kullanılırken dosya yoluna kök erişim izni verilemez. Çalışma diziniyle (veya kullanılıyorsa, temel dizinle) ilişkili bir yol kullanın.
zh_hant: 使用 Glob 時，檔案路徑不可為根目錄。請使用工作目錄或基底目錄 (若使用該目錄) 的相對路徑。

# InvalidMaxConcurrencyValue
source: Invalid value for {0}. The value must be a number value greater than or equal to 1.
cs: Neplatná hodnota pro {0}. Hodnota musí být číselná hodnota větší nebo rovna 1.
de: Ungültiger Wert für {0}. Der Wert muss ein Zahlenwert größer oder gleich 1 sein.
es: Valor no válido para {0}. El valor debe ser un valor numérico mayor o igual que 1.
fr: Valeur non valide pour {0}. La valeur doit être une valeur numérique supérieure ou égale à 1.
it: Valore non valido per {0}. Il valore deve essere un numero maggiore o uguale a 1.
ja: {0} の値が無効です。値は、1 以上の数値である必要があります。
ko: {0}에 대한 값이 잘못되었습니다. 값은 1보다 크거나 같은 숫자 값이어야 합니다.
pl: Nieprawidłowa wartość dla {0}. Wartość musi być większa lub równa 1.
pt_br: Valor inválido para {0}. O valor deve ser um valor numérico maior ou igual a 1.
ru: Недопустимое значение для "{0}". Значение должно быть числом, большим или равным 1.
tr: {0} için geçersiz değer. Değer, 1’den büyük veya buna eşit bir sayı değeri olmalıdır.
zh_hans: {0} 的值无效。该值必须是大于或等于 1 的数值。
zh_hant: {0} 的值無效。值必須是大或等於 1 的數值。

# InvalidUrlValue
source: Invalid value for {0}. The value must be an absolute HTTP or HTTPS URL.
cs: Neplatná hodnota pro {0}. Hodnota musí být absolutní adresa URL protokolu HTTP nebo HTTPS.
de: Ungültiger Wert für {0}. Der Wert muss eine absolute HTTP- oder HTTPS-URL sein.
es: Valor no válido para {0}. El valor debe ser una dirección URL HTTP o HTTPS absoluta.
fr: Valeur non valide pour {0}. La valeur doit être une URL HTTP ou HTTPS absolue.
it: Valore non valido per {0}. Il valore deve essere un URL HTTP o HTTPS assoluto.
ja: {0}の値が無効です。値は HTTP または HTTPS の絶対 URL である必要があります。
ko: {0}에 대한 값이 잘못되었습니다. 값은 절대 HTTP 또는 HTTPS URL이어야 합니다.
pl: Nieprawidłowa wartość dla {0}. Wartość musi być bezwzględnym adresem URL protokołu HTTP lub HTTPS.
pt_br: Valor inválido para {0}. O valor deve ser uma URL HTTP ou HTTPS absoluta.
ru: Недопустимое значение для {0}. Значение должно быть абсолютным URL-адресом HTTP или HTTPS.
tr: {0} için geçersiz değer. Değer mutlak bir HTTP veya HTTPS URL’si olmalıdır.
zh_hans: {0} 的值无效。值必须是绝对 HTTP 或 HTTPS URL。
zh_hant: {0} 的值無效。值必須是絕對 HTTP 或 HTTPS URL。

# ManagedIdentityClientIdOptionDescription
source: The client id of a user assigned ManagedIdentity.
cs: ID klienta Spravované identity přiřazené uživatelem.
de: Die Client-ID einer benutzerzugewiesenen ManagedIdentity.
es: El identificador de cliente de un ManagedIdentity asignado por el usuario.
fr: L’ID client d’un utilisateur à qui a été attribuée ManagedIdentity.
it: ID client di un elemento ManagedIdentity assegnato dall'utente.
ko: ManagedIdentity가 할당된 사용자의 클라이언트 ID입니다.
pl: Identyfikator klienta elementu ManagedIdentity przypisanego przez użytkownika.
pt_br: A ID do cliente de um ManagedIdentity atribuído pelo usuário.
tr: Kullanıcı tarafından atanan yönetilen kimliğin istemci kimliği.

# ManagedIdentityOptionDescription
source: Managed identity to authenticate to Azure Key. (obsolete)
cs: Spravovaná identita pro ověření ve službě Azure Key. (zastaralé)
de: Verwaltete Identität für die Authentifizierung bei Azure Key. (veraltet)
es: Identidad administrada para autenticarse en Azure Key. (obsoleto)
fr: Identité managée pour s’authentifier auprès d’Azure Key. (obsolète)
it: Identità gestita da autenticare in Azure Key. (obsoleto)
ko: Azure Key에 인증할 관리 ID입니다. (사용되지 않음)
pl: Tożsamość zarządzana do uwierzytelnienia w usłudze Azure Key. (przestarzały)
pt_br: Identidade gerenciada a ser autenticada na Chave do Azure Key. (obsoleta)
tr: Azure Key Vault için kimlik doğrulamak amacıyla kullanılan yönetilen kimlik. (kullanımdan kaldırıldı)
zh_hant: 要向 Azure Key 進行驗證的受控識別。(已過時)

# ManagedIdentityOptionObsolete
source: The -kvm and --azure-key-vault-managed-identity options are obsolete and should no longer be specified.
cs: Možnosti -kvm a --azure-key-vault-managed-identity jsou zastaralé a už by se neměly zadávat.
de: Die Optionen „-kvm“ und „--azure-key-vault-managed-identity“ sind veraltet und sollten nicht mehr angegeben werden.
es: Las opciones -kvm y --azure-key-vault-managed-identity están obsoletas y ya no deben especificarse.
fr: Les options -kvm et --azure-key-vault-managed-identity sont obsolètes et ne doivent plus être spécifiées.
it: Le opzioni -kvm e --azure-key-vault-managed-identity sono obsolete e non devono più essere specificate.
ko: -kvm 및 --azure-key-vault-managed-identity 옵션은 사용되지 않으므로 더 이상 지정하지 않아야 합니다.
pl: Opcje -kvm i --azure-key-vault-managed-identity są przestarzałe i nie należy ich już określać.
pt_br: As opções -kvm e --azure-key-vault-managed-identity são obsoletas e não devem mais ser especificadas.
tr: -kvm ve --azure-key-vault-managed-identity seçenekleri kullanımdan kaldırıldı ve artık belirtilmemelidir.
zh_hant: -kvm 和 --azure-key-vault-managed-identity 選項已過時，不應再指定。

# ManagedIdentityResourceIdOptionDescription
source: The resource id of a user assigned ManagedIdentity.
cs: ID prostředku Spravované identity přiřazené uživatelem.
de: Die Ressourcen-ID einer vom Benutzer zugewiesenen ManagedIdentity.
es: El identificador de recurso de un ManagedIdentity asignado por el usuario.
fr: L’ID de ressource d’une ManagedIdentity attribuée à un utilisateur.
it: ID risorsa di un elemento ManagedIdentity assegnato dall'utente.
ko: 사용자가 할당한 ManagedIdentity의 리소스 ID입니다.
pl: Identyfikator zasobu elementu ManagedIdentity przypisanego przez użytkownika.
pt_br: A ID de recurso de um ManagedIdentity atribuído pelo usuário.
tr: Kullanıcı tarafından atanan yönetilen kimliğin kaynak kimliği.

# MaxConcurrencyOptionDescription
source: Maximum concurrency.
cs: Maximální souběžnost.
de: Maximale Parallelität.
es: Simultaneidad máxima.
fr: Concurrence maximale.
it: Concorrenza massima.
ja: 最大コンカレンシー。
ko: 최대 동시성입니다.
pl: Maksymalna współbieżność.
pt_br: Simultaneidade máxima.
ru: Максимальный параллелизм.
tr: Maksimum eşzamanlılık.
zh_hans: 最大并发。
zh_hant: 並行最大值。

# MissingFileValue
source: A file or glob is required.
cs: Vyžaduje se soubor nebo glob.
de: Eine Datei oder ein Glob ist erforderlich.
es: Se requiere un archivo o glob.
fr: Un fichier ou un glob est requis.
it: È necessario specificare un file o un GLOB.
ja: ファイルまたは glob が必要です。
ko: 파일 또는 글로브가 필요합니다.
pl: Wymagany jest plik lub element globalny.
pt_br: É necessário um arquivo ou um glob.
tr: Dosya veya glob gerekiyor.
zh_hant: 需要檔案或 Glob。

# NoFilesToSign
source: No inputs found to sign.
cs: Nenašly se žádné vstupy, které by bylo možné podepsat.
de: Es wurden keine Eingaben zum Signieren gefunden.
es: No se encontraron entradas para firmar.
fr: Aucune entrée à signer.
it: Non sono stati trovati input da firmare.
ja: 署名する入力が見つかりません。
ko: 서명할 입력이 없습니다.
pl: Nie znaleziono danych wejściowych do podpisania.
pt_br: Nenhuma entrada encontrada para autenticar.
tr: İmzalanacak giriş dosyası yok.
zh_hant: 找不到要簽署的輸入。

# OutputOptionDescription
source: Output file or directory. If omitted, input files will be overwritten.
cs: Výstupní soubor nebo adresář. Pokud je tento parametr vynechán, vstupní soubory budou přepsány.
de: Ausgabedatei oder -verzeichnis. Wenn dies weggelassen wird, werden Eingabedateien überschrieben.
es: Archivo o directorio de salida. Si se omite, se sobrescribirán los archivos de entrada.
fr: Fichier ou répertoire de sortie. En cas d’omission, les fichiers d’entrée sont remplacés.
it: File o directory di output. Se omessi, i file di input verranno sovrascritti.
ja: 出力ファイルまたはディレクトリ。省略すると、入力ファイルが上書きされます。
ko: 출력 파일 또는 디렉터리입니다. 생략하면 입력 파일을 덮어씁니다.
pl: Plik wyjściowy lub katalog. W przypadku pominięcia pliki wejściowe zostaną zastąpione.
pt_br: Arquivo ou diretório de saída. Se omitido, os arquivos de entrada serão substituídos.
ru: Выходной файл или каталог. Если этот параметр опущен, входные файлы будут перезаписаны.
tr: Çıkış dosyası veya dizini. Atlanırsa, giriş dosyalarının üzerine yazılır.
zh_hans: 输出文件或目录。如果省略，则输入文件将被覆盖。
zh_hant: 輸出檔案或目錄。如果省略，則會覆寫輸入檔案。

# PublisherNameOptionDescription
source: Publisher name (ClickOnce).
cs: Název vydavatele (ClickOnce)
de: Herausgebername (ClickOnce).
es: Nombre del publicador (ClickOnce).
fr: Nom du serveur de publication (ClickOnce).
it: Nome autore (ClickOnce).
ja: パブリッシャー名 (ClickOnce)。
ko: 게시자 이름(ClickOnce).
pl: Nazwa wydawcy (ClickOnce).
pt_br: Nome do editor (ClickOnce).
ru: Имя издателя (ClickOnce).
tr: Yayımcı adı (ClickOnce).
zh_hans: 发布服务器名称(ClickOnce)。
zh_hant: 發行者名稱 (ClickOnce)。

# SignCommandDescription
source: Sign CLI
cs: Podepsat rozhraní příkazového řádku
de: CLI signieren
es: Firma de la CLI
fr: Signer l’interface CLI
it: Consente di firmare l'interfaccia della riga di comando
ja: CLI に署名
ko: CLI 서명
pl: Interfejs wiersza polecenia podpisywania
pt_br: Autenticar CLI
ru: Подписывание CLI
tr: CLI’yı imzala
zh_hans: 对 CLI 进行签名
zh_hant: 簽署 CLI
