Repository: dotnet/sign
Catalog: src/Sign.Cli/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SomeFilesDoNotExist
source: Some files do not exist. Try using a different {0} value or a fully qualified file path.
cs: Některé soubory neexistují. Zkuste použít jinou hodnotu {0} nebo plně kvalifikovanou cestu k souboru.
de: Einige Dateien sind nicht vorhanden. Versuchen Sie, einen anderen {0}-Wert oder einen vollqualifizierten Dateipfad zu verwenden.
es: Algunos archivos no existen. Pruebe a usar otro valor {0} o una ruta de acceso de archivo completa.
fr: Certains fichiers n’existent pas. Essayez d’utiliser une autre valeur {0} ou un chemin de fichier complet.
it: Alcuni file non esistono. Provare a usare un valore di {0} diverso o un percorso di file completo.
ja: 一部のファイルが存在しません。別の {0} 値または完全修飾ファイル パスを使用してみてください。
ko: 일부 파일이 존재하지 않습니다. 다른 {0} 값 또는 정규화된 파일 경로를 사용해 보세요.
pl: Niektóre pliki nie istnieją. Spróbuj użyć innej wartości {0} lub w pełni kwalifikowanej ścieżki pliku.
pt_br: Alguns arquivos não existem. Tente usar um valor diferente de {0} ou um caminho de arquivo totalmente qualificado.
tr: Bazı dosyalar mevcut değil. Farklı bir {0} değeri veya tam bir dosya yolu kullanmayı deneyin.
zh_hant: 某些檔案不存在。請嘗試使用不同的 {0} 值或完整檔案路徑。

# TenantIdOptionDescription
source: Tenant ID to authenticate to Azure.
cs: ID tenanta pro ověření v Azure.
de: Mandanten-ID für die Authentifizierung bei Azure.
es: Id. de inquilino para autenticarse en Azure.
fr: ID du locataire pour s’authentifier auprès d’Azure.
it: ID tenant da autenticare in Azure.
ko: Azure에 인증할 테넌트 ID입니다.
pl: Identyfikator dzierżawy na potrzeby uwierzytelniania na platformie Azure.
pt_br: ID do locatário a ser autenticada no Azure.
tr: Azure için kimlik doğrulamak amacıyla kullanılan kiracı kimliği.
zh_hant: 要向 Azure 進行驗證的租用戶識別碼。

# TimestampDigestOptionDescription
source: Digest algorithm for the RFC 3161 timestamp server. Allowed values are sha256, sha384, and sha512.
cs: Algoritmus hodnoty hash pro server časového razítka RFC 3161. Povolené hodnoty jsou sha256, sha384 a sha512.
de: Digest-Algorithmus für den RFC 3161-Zeitstempelserver. Zulässige Werte sind sha256, sha384 und sha512.
es: Algoritmo de resumen para el servidor de marca de tiempo RFC 3161. Los valores permitidos son sha256, sha384 y sha512.
fr: Algorithme de hachage pour le serveur d’horodatage RFC 3161. Les valeurs autorisées sont sha256, sha384 et sha512.
it: Algoritmo di digest per il server di timestamp RFC 3161. I valori consentiti sono sha256, sha384 e sha512.
ja: RFC 3161 タイムスタンプ サーバーのダイジェスト アルゴリズム。使用できる値は、sha256、sha384、および sha512 です。
ko: RFC 3161 타임스탬프 서버용 다이제스트 알고리즘입니다. 허용되는 값은 sha256, sha384 및 sha512입니다.
pl: Algorytm skrótu dla serwera znacznika czasu RFC 3161. Dozwolonymi wartościami są: sha256, sha384 i sha512.
pt_br: Resumo do algoritmo para o servidor de carimbo de data/hora RFC 3161. Os valores permitidos são sha256, sha384 e sha512.
ru: Алгоритм дайджеста для сервера меток времени RFC 3161. Допустимые значения: sha256, sha384 и sha512.
tr: RFC 3161 zaman damgası sunucusu için karma algoritması. İzin verilen değerler şunlardır. sha256, sha384 ve sha512.
zh_hans: RFC 3161 时间戳服务器的摘要算法。允许的值为 sha256、sha384 和 sha512。
zh_hant: RFC 3161 時間戳記伺服器的摘要演算法。允許的值為 sha256、sha384 和 sha512。

# TimestampUrlOptionDescription
source: RFC 3161 timestamp server URL.
cs: Adresa URL serveru časového razítka RFC 3161.
de: URL für RFC 3161-Zeitstempelserver.
es: Dirección URL del servidor de marca de tiempo RFC 3161.
fr: URL du serveur d'horodatage conforme au document RFC 3161.
it: URL del server di timestamp RFC 3161.
ja: RFC 3161 タイムスタンプ サーバーの URL。
ko: RFC 3161 타임스탬프 서버 URL.
pl: Adres URL serwera znacznika czasu RFC 3161.
pt_br: URL do servidor de carimbo de data/hora do RFC 3161.
ru: URL-адрес сервера меток времени RFC 3161.
tr: RFC 3161 zaman damgası sunucusu URL’si.
zh_hans: RFC 3161 时间戳服务器 URL。
zh_hant: RFC 3161 時間戳記伺服器 URL。

# VerbosityOptionDescription
source: Sets the verbosity level. Allowed values are 'none', 'critical', 'error', 'warning', 'information', 'debug', and 'trace'.
cs: Nastaví úroveň podrobností. Povolené hodnoty jsou none, critical, error, warning, information, debug a trace.
de: Legt den Ausführlichkeitsgrad fest. Zulässige Werte sind "none", "critical", "error", "warning", "information", "debug" und "trace".
es: Establece el nivel de detalle. Los valores permitidos son "none", "critical", "error", "warning", "information", "debug" y "trace".
fr: Définit le niveau de verbosité. Les valeurs autorisées sont 'none', 'critical', 'error', 'warning', 'information', 'debug', et 'trace'
it: Imposta il livello di dettaglio. I valori consentiti sono 'none', 'critical', 'error', 'warning', 'information', 'debug' e 'trace'.
ja: 詳細レベルを設定します。指定できる値は、'none'、'critical'、'error'、'warning'、'information'、'debug'、'trace' です。
ko: 세부 정보 표시 수준을 설정합니다. 허용되는 값은 'none', 'critical', 'error', 'warning', 'information', 'debug' 및 'trace'입니다.
pl: Ustawia poziom szczegółowości. Dozwolone wartości to „none”, „critical”, „error”, „warning”, „information”, „debug” i „trace”.
pt_br: Define o nível de detalhamento. Os valores permitidos são 'none', 'critical', 'error', 'warning', 'information', 'debug' e 'trace'.
ru: Задает уровень детализации. Допустимые значения: "none" (нет), "critical" (критическое), "error" (ошибки), "warning" (предупреждения), "information" (информация), "debug" (отладка) и "trace" (трассировка).
tr: Ayrıntı düzeyini ayarlar. İzin verilen değerler: 'none', 'critical', 'error', 'warning', 'information', 'debug' ve 'trace'.
zh_hans: 设置详细级别。允许的值为 "none"、"critical"、"error"、"warning"、"information"、"debug" 和 "trace"。
zh_hant: 設定詳細資訊層級。允許的值為 'none'、'critical'、'error'、'warning'、'information'、'debug' 和 'trace'。

# x86NotSupported
source: Only Windows x64 is supported at this time. See https://github.com/dotnet/sign/issues/474 regarding Windows x86 support.
cs: V současné době je podporován pouze systém Windows x64. Podívejte se na https://github.com/dotnet/sign/issues/474 týkající se podpory windows x86.
de: Derzeit wird nur Windows x64 unterstützt. Weitere Informationen hinsichtlich Windows x86-Support finden Sie unter https://github.com/dotnet/sign/issues/474.
es: En este momento solo se admite Windows x64. Consulta https://github.com/dotnet/sign/issues/474 sobre la compatibilidad con Windows x86.
fr: Seul Windows x64 est pris en charge pour l’instant. Consultez https://github.com/dotnet/sign/issues/474 concernant la prise en charge de Windows x86.
it: Al momento è supportato solo Windows x64. Vedere https://github.com/dotnet/sign/issues/474 sul supporto per Windows x86.
ja: 現時点でサポートされているのは Windows x64 のみです。Windows x86 のサポートに関する https://github.com/dotnet/sign/issues/474 を参照してください。
ko: 현재 Windows x64만 지원됩니다. Windows x86 지원에 대해서는 https://github.com/dotnet/sign/issues/474를 참조하세요.
pl: Obecnie obsługiwany jest tylko system Windows x64. Zobacz stronę https://github.com/dotnet/sign/issues/474 odnośnie pomocy technicznej systemu Windows x86.
pt_br: No momento, somente o Windows x64 é compatível. Consulte https://github.com/dotnet/sign/issues/474 para obter suporte com o Windows x86.
ru: Сейчас поддерживается только Windows x64. Сведения о поддержке Windows x86 см. на странице https://github.com/dotnet/sign/issues/474.
tr: Şu anda yalnızca Windows x64 destekleniyor. Windows x86 desteği için https://github.com/dotnet/sign/issues/474 sayfasına bakın.
zh_hans: 目前仅支持 Windows x64。有关 Windows x86 支持，请参阅 https://github.com/dotnet/sign/issues/474。
zh_hant: 目前只支援 Windows x64。如需 Windows x86 支援，請參閱 https://github.com/dotnet/sign/issues/474 (英文)。

# FileListOptionDescription
source: Path to file containing paths of files to sign within an archive.
ru: Путь к файлу, содержащему пути к файлам для подписи в архиве.
zh_hans: 文件的路径，包含存档中要签名的文件的路径。
